def sel(K):
    global ans
    if len(''.join(path)) == N:
        ans += 1
        return
    if len(''.join(path)) > N:
        return
    for i in range(0, 4):
        path.append(nums[i])
        sel(K)
        path.pop()

nums = ['1', '22', '333', '4444']

N = int(input())
ans = 0
path = []
sel(N)
print(ans)







"""
아름다운 수

1이상 4이하의 정수로만 이루어져 있으면서, 정확히 해당 숫자만큼 연달아 같은 숫자가 나오는 수를 아름다운 수라고 부릅니다.

예를 들어 1333221는 1이 1번, 3이 3번, 2가 2번 그리고 1이 1번 연속하여 나오므로 아름다운 수입니다.

이때 동일한 숫자에 대해 연달아 같은 숫자의 묶음이 나오는 것 또한 아름다운 수입니다.

예를 들어 111, 22222222와 같은 수 역시 1이 1번 나온 것이 3번 반복되었고, 2가 2번 나온 것이 4번 반복되었다고 할 수 있기 때문에 아름다운 수라고 할 수 있습니다. 
다만, 222의 경우에는 2가 2번 나온 뒤, 다시 2가 1번 나왔으므로 아름다운 수가 아닙니다.

N자리 아름다운 수가 몇 개 있는지를 구하는 프로그램을 작성해보세요.

1, 22, 333, 4444만 써서
N자리 수 만들기

"""